#20210518 zjq
# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

l1: 4
l2: 8
c1: 128
c2: 512

# anchors:
#   [7,15, 8,18, 9,21]  # P3/32
#   [13,16, 17,7, 17,17]  # P4/64
#   [19,11, 22,28, 30,11]  # P5/128


# steam:
#   [[-1, 1, Conv, [3, 3, 1]],  # 0
#    [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
#    [-1, 1, Bottleneck, [64]],
#    [-1, 1, Conv, [32, 1, 1]],
#   ]
# steam:
#   [[-1, 1, Conv, [16, 1, 1]],  # 0
#   ]

# YOLOv11.0n backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, MF, [3]],
  #  [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
  [-1, 2, C3k2, [256, False, 0.5]],
  [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
  [-1, 2, C3k2, [512, False, 0.5]],
  [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
  [-1, 2, C3k2, [512, True]],
  [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
  [-1, 2, C3k2, [1024, True]],
  [-1, 1, SPPF, [1024, 5]], # 9
  [-1, 2, C2PSA, [1024]], # 10
  ]

# YOLOv11.0n head
head:
  [[-1, 1, nn.Upsample, [None, 2, "nearest"]],
  [[-1, 6], 1, Concat, [1]], # cat backbone P4
  [-1, 2, C3k2, [512, False]], # 13

  [-1, 1, nn.Upsample, [None, 2, "nearest"]],
  [[-1, 4], 1, Concat, [1]], # cat backbone P3
  [-1, 2, C3k2, [256, False]], # 16 (P3/8-small)

  # [-1, 1, Conv, [256, 3, 2]],
  # [[-1, 13], 1, Concat, [1]], # cat head P4
  # [-1, 2, C3k2, [512, False]], # 19 (P4/16-medium)

  # [-1, 1, Conv, [512, 3, 2]],
  # [[-1, 10], 1, Concat, [1]], # cat head P5
  # [-1, 2, C3k2, [1024, True]], # 22 (P5/32-large)

  [[16], 1, Detect, [nc,anchors]] # Detect(P3, P4, P5)
  ]

